#+TITLE: organic
#+CATEGORY: open-source

*** raw tree

#+BEGIN_SRC sh :results output
cd src
tree -J
#+END_SRC

#+RESULTS:
#+begin_example
[{"type":"directory","name": ".","contents":[
    {"type":"directory","name":"Data","contents":[
      {"type":"directory","name":"Db","contents":[
        {"type":"file","name":"DbHelper.js"},
        {"type":"file","name":"Db.js"}
      ]},
      {"type":"directory","name":"Models","contents":[
        {"type":"file","name":"OrgFile.js"},
        {"type":"file","name":"OrgNode.js"},
        {"type":"file","name":"OrgTag.js"},
        {"type":"file","name":"OrgTimestamp.js"}
      ]},
      {"type":"file","name":"Queries.js"},
      {"type":"file","name":"Sync.js"},
      {"type":"file","name":"Transforms.js"}
    ]},
    {"type":"directory","name":"Helpers","contents":[
      {"type":"file","name":"Crc.js"},
      {"type":"file","name":"Debug.js"},
      {"type":"file","name":"FileAccess.js"},
      {"type":"file","name":"Fixtures.js"},
      {"type":"file","name":"Functions.js"},
      {"type":"directory","name":"__mocks__","contents":[
        {"type":"file","name":"FileAccess.js"}
      ]}
    ]},
    {"type":"file","name":"OrgApi.js"},
    {"type":"directory","name":"OrgFormat","contents":[
      {"type":"directory","name":"AtomicParsers","contents":[
        {"type":"file","name":"HeadlineParser.js"},
        {"type":"file","name":"NodeContentParser.js"},
        {"type":"file","name":"NodeMetadataParser.js"}
      ]},
      {"type":"file","name":"Export.js"},
      {"type":"directory","name":"GenericParsers","contents":[
        {"type":"file","name":"Common.js"},
        {"type":"file","name":"HungryLineParser.js"},
        {"type":"file","name":"LazyInLineParser.js"},
        {"type":"file","name":"LazyLineParser.js"},
        {"type":"file","name":"LinesRangeParser.js"}
      ]},
      {"type":"file","name":"NodesExtractor.js"},
      {"type":"file","name":"Parser.js"},
      {"type":"file","name":"Regex.js"},
      {"type":"file","name":"Transforms.js"},
      {"type":"file","name":"Validators.js"}
    ]}
  ]},
  {"type":"report","directories":8,"files":30}
]
#+end_example

*** lisp
#+BEGIN_SRC emacs-lisp
(defun keenan/refactor ()
  (interactive)
  (let ((ancestors (mapcar (lambda (i) (org-entry-get i "ITEM"))(orgnav-tree-ancestors))))

    (message "Ancestors %s" (s-join "/" (reverse ancestors)))
  )
  )
(keenan/refactor)
#+END_SRC

#+RESULTS:
: Ancestors How to get path of org node in list ?/lisp
